// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");


// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -
// 1, -7, 567, 89, 223-> 3
Console.WriteLine("Hello, Рустем!");
Console.WriteLine();






Console.WriteLine();
Console.WriteLine("конец алгоритма 41");